app/Http/Controllers/PostController.php

select * from `posts`
---
    public function index()
    {
        $posts = Post::with('comments')->get();

insert into `posts` (`title`, `body`, `updated_at`, `created_at`) values ('Something new', 'lorem ipsum lorem ipsum lorem ipsum lorem ipsum lorem ipsum', '2024-05-29 22:51:02', '2024-05-29 22:51:02')
insert into `comments` (`body`, `commentable_id`, `commentable_type`, `updated_at`, `created_at`) values ('This is the first comment.', 11, 'App\Models\Post', '2024-05-29 23:07:23', '2024-05-29 23:07:23')
---
    public function store(Request $request)
    {
        $post = Post::create($request->except('comments'));

        if ($request->has('comments')) {
            $commentsData = $request->input('comments');
            foreach ($commentsData as $commentData) {
                $comment = new Comment(['body' => $commentData['body']]);
                $post->comments()->save($comment);

update `posts` set `title` = 'Something new updated', `posts`.`updated_at` = '2024-05-29 23:12:58' where `id` = 11
update `comments` set `body` = 'This is the first comment updated.', `comments`.`updated_at` = '2024-05-29 23:12:58' where `id` = 64
---
    public function update(Request $request, Post $post)
    {
        $post->update($request->except('comments'));

        if ($request->has('comments')) {
            $commentsData = $request->input('comments');
            foreach ($commentsData as $commentData) {
                $comment = $post->comments()->find($commentData['id']);
                if ($comment) {
                    $comment->update(['body' => $commentData['body']]);

delete from `posts` where `id` = 11
---
    public function destroy(Post $post)
    {
        $post->delete();