app/Http/Controllers/UserController.php

select * from `users`
---
    public function index()
    {
        $users = User::with('image')->get();

update `users` set `name` = 'Elmer Alvarado', `users`.`updated_at` = '2024-05-29 13:35:44' where `id` = 11
insert into `images` (`url`, `imageable_id`, `imageable_type`, `updated_at`, `created_at`) values ('images/U3nBCz2lrpXtr2hsfhWhsQewwSNcsEQLZMqckfKC.png', 11, 'App\Models\User', '2024-05-29 13:35:45', '2024-05-29 13:35:45')
---
    public function update(Request $request, User $user)
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'image' => 'nullable|image|mimes:jpeg,png,jpg,gif|max:2048'
        ]);

        $user->update($request->only('name'));

        if ($request->has('image')) {
            $user->image()->delete();
            $user->image()->create(['url' => $request->file('image')->store('images')]);

delete from `users` where `id` = 11
---
    public function destroy(User $user)
    {
        $user->delete();