app/Http/Controllers/VideoController.php

    public function index()
    {
        $videos = Video::with('comments')->get();
---
select * from `videos`

    public function store(Request $request)
    {
        $video = Video::create($request->except('comments'));

        if ($request->has('comments')) {
            $commentsData = $request->input('comments');
            foreach ($commentsData as $commentData) {
                $comment = new Comment(['body' => $commentData['body']]);
                $video->comments()->save($comment);
---
insert into `videos` (`title`, `url`, `updated_at`, `created_at`) values ('New Video Uploaded', 'new-video.url', '2024-05-29 23:28:08', '2024-05-29 23:28:08')
insert into `comments` (`body`, `commentable_id`, `commentable_type`, `updated_at`, `created_at`) values ('This is the first comment updated.', 11, 'App\Models\Video', '2024-05-29 23:28:08', '2024-05-29 23:28:08')

    public function update(Request $request, Video $video)
    {
        $video->update($request->except('comments'));

        if ($request->has('comments')) {
            $commentsData = $request->input('comments');
            foreach ($commentsData as $commentData) {
                $comment = $video->comments()->find($commentData['id']);
                if ($comment) {
                    $comment->update(['body' => $commentData['body']]);
---
update `videos` set `url` = 'new-video.urll', `videos`.`updated_at` = '2024-05-29 23:28:54' where `id` = 11
update `comments` set `body` = 'This is the third comment updated.', `comments`.`updated_at` = '2024-05-29 23:28:54' where `id` = 69

    public function destroy(Video $video)
    {
        $video->delete();
---
delete from `videos` where `id` = 11